# შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

#3) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი

#4) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

#5) მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი შეცდომების გარეშე


user_input = input("შეიყვანეთ მნიშვნელობა: ")


data_type = type(user_input)
print(f"თქვენი შეყვანილი მონაცემი არის: {data_type}")


string_ig = "gaumarjos"  
integer_ig = 23  
float_ig = 3.69 
string_ig2 = "Python"  
integer_ig2 = 102  


ig1 = "Hello"  
ig2 = 33  
ig3 = 8.22

print(f"var1 არის {type(ig1)}")
print(f"var2 არის {type(ig2)}")
print(f"var3 არის {type(ig3)}")

current_age = int(input("შეიყვანეთ თქვენი ასაკი: "))
years_to_add = int(input("რამდენი წელი უნდა დავამატოთ?: "))
future_age = current_age + years_to_add

print("{years_to_add} წლის შემდეგ თქვენ იქნებით {future_age} წლის.")